Revit 2026 API

# LossFactor Class

---

This class is the base class for calculating lighting loss factor.

SystemObject Autodesk.Revit.DB.LightingLossFactor Autodesk.Revit.DB.LightingAdvancedLossFactor Autodesk.Revit.DB.LightingBasicLossFactor

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LossFactor : IDisposable
```
```vb
Public Class LossFactor
	Implements IDisposable
```
```cpp
public ref class LossFactor : IDisposable
```
```fsharp
type LossFactor =
    class
        interface IDisposable
    end
```

The LossFactor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LossFactorValue | The calculated loss factor value |

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Creates a copy of the LossFactor derived object. |
|  | Dispose | Releases all resources used by the LossFactor |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Lighting Namespace